TexasInstruments/mspm0-sdk/examples/nortos/LP_MSPM0C1104/driverlib/sysctl_frequency_clock_counter/sysctl_frequency_clock_counter.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 */
// @cliArgs --device "MSPM0C110X" --package "VSSOP-20(DGS20)" --part "Default"
// @cliArgs --board /ti/boards/LP_MSPM0C1104 --rtos nortos

/**
 * Import the modules used in this configuration.
 */
const Board  = scripting.addModule("/ti/driverlib/Board");
const GPIO   = scripting.addModule("/ti/driverlib/GPIO", {}, false);
const GPIO1  = GPIO.addInstance();
const SYSCTL = scripting.addModule("/ti/driverlib/SYSCTL");

/**
 * Write custom configuration values to the imported modules.
 */
const fcc1      = system.clockTree["FCC"];
fcc1.enable     = true;
fcc1.fccPeriods = "02";

const gate3  = system.clockTree["EXCLKGATE"];
gate3.enable = true;

const mux5       = system.clockTree["FCCSELCLKMUX"];
mux5.inputSelect = "FCCSELCLKMUX_SYSOSC";

const mux6       = system.clockTree["FCCTRIGMUX"];
mux6.inputSelect = "FCCTRIGMUX_LFCLK";

const pinFunction1  = system.clockTree["CLKOUT"];
pinFunction1.enable = true;


GPIO1.$name                         = "GPIO_LEDS";
GPIO1.associatedPins[0].$name       = "USER_LED_1";
GPIO1.associatedPins[0].assignedPin = "4";
GPIO1.associatedPins[0].invert      = "ENABLE";

SYSCTL.clockTreeEn       = true;
SYSCTL.validateClkStatus = true;
